#pragma once
void MTurnPC(char a[3][3], char q2) {
	int i, j;
	bool f = 0;
	while (f == 0) {
		int b2 = 0, n = 0, ni = 0, nj = 0;
		// 1) По строчкам
		for (i = 0; i < 3; i++) {
			for (j = 0; j < 3; j++) {
				if (a[i][j] == q2) b2++; // счетчик "своих" знаков
				if (a[i][j] == '-') {	 // обнаружение пустых клеток
					n++;				 // счетчик пустых клеток
					if (b2 == 2) nj = j; // запоминание координаты пустой клетки в текущей строке
				}
			}
			if (b2 == 2) {
				a[i][nj] = q2; // дополнение строки 3-им символом
				f = 1;
				break;
			}
			b2 = n = 0;
		}
		// 2) По столбцам
		for (j = 0; j < 3; j++) {
			for (i = 0; i < 3; i++) {
				if (a[i][j] == q2) b2++;
				//if (a[i][j] == q1) b1++;
				if (a[i][j] == '-') {
					n++;
					if (b2 == 2) ni = i;
				}
			}
			if (b2 == 2) {
				a[ni][j] = q2;
				f = 1;
				break;
			}
			b2 = n = 0;
		}
		b2 = n = 0;
		// 3) По диагонали слева направо
		for (i = 0; i < 3; i++) {
			if (a[i][i] == q2) b2++;
			//if (a[i][i] == q1) b1++;
			if (a[i][i] == '-') {
				n++;
				if (b2 == 2) ni = i;
			}
			if (b2 == 2) {
				a[ni][ni] = q2;
				f = 1;
				break;
			}
		}
		b2 = n = 0;
		// 4) По диагонали справа налево

		if (a[2][0] == '-') {
			n++;
			ni = 2;
			nj = 0;
		}
		if (a[2][2] == '-') {
			n++;
			ni = 2;
			nj = 2;
		}
		if (a[0][2] == '-') {
			n++;
			ni = 2;
			nj = 0;
		}
		if (n == 1) {
			a[ni][nj] = q2;
			n = 0;
			f = 1;
			break;
		}
		n = 0;
		// 5) Случайный ход
		do {
			i = rand() % 3;
			j = rand() % 3;
		} while (a[i][j] != '-');
		a[i][j] = q2;
		f = 1;
		break;
	}
}